Tekla Open API Reference for Tekla Structures 2025
ProfileItemEnumerator.SelectInstances Property
 Indicates that the instance Select() is called when the 'Current' item is asked from the enumerator. The user can set this to 'false' if no members are ever asked from the instance. This is the case when, for example, asking only for the available profile names or when only certain profiles need to be selected from the model. Without the selection the 'Current' item contains the profile name or the prefix and the profile type. Warning: normally the user should not change this value.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SelectInstances { get; set; }
Public Property SelectInstances As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
ProfileItemEnumerator Class
Tekla.Structures.Catalogs Namespace